package part1.week2;

/**
 Имеется множество из n работ и два станка.
 Время выполнения i-й работы на первом станке равно a_i,
 время выполнения i-й работы на втором станке равно b_i.
 Каждую работу надо выполнить сначала на первом станке, потом на втором.
 И на первом, и на втором станке работы можно выполнять в произвольном порядке.
 Каждый станок в каждый момент времени может выполнять только одну работу.
 Минимизируйте C_max— время выполнения последней работы на втором станке.
 Формат входных данных
 В первой строке дано одно целое число n (1 <= n <= 100 000) — количество работ.
 В следующей строке n целых чисел от 0 до 10^6 – время выполнения работ на первом станке.
 В следующей строке n целых чисел от 0 до 10^6 – время выполнения работ на втором станке.
 Формат выходных данных
 В первой строке выведите единственное число — C_max.
 Во второй строке выведите перестановку – порядок выполнения работ на первом станке.
 В третьей строке выведите перестановку – порядок выполнения работ на втором станке.
 */
public class I {
}
